package cn.applesay.tag.ext.util;

public class ChineseNormalize
{
  static final char SBC_CHAR_START = '！';

  static final char SBC_CHAR_END = '～';

  static final int CONVERT_STEP = 65248;

  static final char SBC_SPACE = '　';

  static final char DBC_SPACE = ' ';

  static String simpleChinese = "深浍珲傩阗灶贽昽缁峤佥荫郓砀缯纩蓣窥漓鹖䓕镓钫钚铷竖镧锕铹铪诎帮画钌功颋荥阏赝轵缳絶芈阅辏玚阍狝鹴缟跸谥贶赉辎摅鹱讬鲆铌黡鲋荠苈录酝锍饩鲧钩郏陉伪锎锇绣铁牺窑阃怿讠饣纟钅呙祢虮蛏鲻粝弪镝娈铖猃郐苌鹚欤锸浐颥鞯锆觋呖牦觇猡铈阇诹奖驺嫱铙诂黾铻峄栎栀蛲同荩赍餍阈阕诔鸸鹋妫瘘骂觯绂飑枧缦骘裈鲡鲭骕颎钵庑戯筼渑崂跞镢魉鸡蝾螨垅莼韫梿鲛媪颕戬缊缫鹩䴕䴘钪锛䯄鲇鳔㶶槚赑鲕鼍鲉赍鲒绹螀瘿馕鲎骙窭笾饧铋骃麸锝铑钷镅锔诜绿鹀蕴驵俫犸辀粜锐镟鳉鲙齑赪鲊箨鲹镄锘锫黉腭鲼䴓帱赒绋瘗缡橼谵绦苧鲂垱垭祃唡悫槠觏颓辒镔镎镤颀骕涞泺采鹲鲞哕赜㶉诼辋鳆怃砻贳痖缒镗钆铕漤鼋镱䍁锞錾岽诓蒌铒铽钶镏砜镨钬铥锽轹镦锼蓠钘髌埘厕砗壳绠觍穑锳赇煴毵㧑龁嵚绔鳛椟阄绲骀颡刿莸鳄訚蕰谞骟哓绖镡鸴硁嫒鹾镘鲘榇缃鲕䜧舻芸纻镟栊馓屦㖊荙谣舣聍驲屃骖垲缌箦莼锧嵝鳎鹢铇谠苁蝈撺鲒鹣蒇沩鳓饫伣饾饤鳑鲏瘅疭滠辚讱镌阛阓酂愦鲚戯馎饦玱鳇剀轺栌椤谇绡钭鲌桤蔹榅胡鲅鹛瘘厍绨窵赕绁唝疬䞐赙闫骦鲦纴棁骎傧缋絷腽阌闬诇鹇龂䓖袯诐鳣刭龆鰃鲬锓涠鰮觌挜鳣耧鳡玱绷荭闶蒉躜鳢悮鲾吣骉耢鲪厐赗馃飖筜鸧鹒鯝酾㶽鹓滪缰挦阘鹔鸺瞆滗挢厣泶挜㧟趱钑臜鸹鹝蔂鱾鲿鲓鲿鳠鲯锊伛浈俫阓婳鱽鲖胨啴轱簖窎勚诖缲赗辌赆镆凫鹯悮诇亸鳈鹥䴔擼鸤鸼枨鳙锃沩蘖霡锿馂氇绱绱钇铍生为诒钋骓镥众汇缬专泪线卜荛胁旸国岩处麻涂飙昆箬启顼颜参鹠克床鹍关历铫邻鲐锖说樯勖萚镈硙乃回潆钟鞑里纟汇皑蔼碍爱袄奥坝罢摆败颁办绊帮绑镑谤剥饱宝报鲍辈贝钡狈备惫绷笔毕毙币闭边编贬变辩辫标鳖别瘪濒滨宾摈饼并拨钵铂驳卜补财参蚕残惭惨灿苍舱仓沧厕侧册测层诧搀掺蝉馋谗缠铲产阐颤场尝长偿肠厂畅钞车彻尘陈衬撑称惩诚骋痴迟驰耻齿炽冲虫宠畴踌筹绸丑橱厨锄雏础储触处传疮闯创锤纯绰辞词赐聪葱囱从丛凑蹿窜错达带贷担单郸掸胆惮诞弹当挡党荡档捣岛祷导盗灯邓敌涤递缔颠点垫电淀钓调谍迭钉顶锭订丢东动栋冻斗犊独读赌镀锻断缎兑队对吨顿钝夺堕鹅额讹恶饿儿尔饵贰发罚阀珐矾钒烦范贩饭访纺飞诽废费纷坟奋愤粪丰枫锋风疯冯缝讽凤肤辐抚辅赋复负讣妇缚该钙盖干赶秆赣冈刚钢纲岗镐搁鸽阁铬个给龚宫巩贡钩沟构购够蛊顾剐关观馆惯贯广规硅归龟闺轨诡柜贵刽辊滚锅国过骇韩汉号阂鹤贺横轰鸿红后壶护沪户哗华画划话怀坏欢环还缓换唤痪焕涣黄谎挥辉毁贿秽会烩汇讳诲绘荤浑伙获货祸击机积饥讥鸡绩缉极辑级挤几蓟剂济计记际继纪夹荚颊贾钾价驾歼监坚笺间艰缄茧检碱碱拣捡简俭减荐槛鉴践贱见键舰剑饯渐溅涧将浆蒋桨奖讲酱胶浇骄娇搅铰矫侥脚饺缴绞轿较阶节茎鲸惊经颈静镜径痉竞净纠厩旧驹举据锯惧剧鹃绢杰洁结诫届紧锦仅谨进晋烬尽劲荆觉决诀绝钧军骏开凯颗壳课垦恳抠库裤夸块侩宽矿旷况亏岿窥馈溃扩阔蜡腊莱来赖蓝栏拦篮阑兰澜谰揽览懒缆烂滥捞劳涝乐镭垒类泪篱离里鲤礼丽厉励砾历沥隶俩联莲连镰怜涟帘敛脸链恋炼练粮凉两辆谅疗辽镣猎临邻鳞凛赁龄铃凌灵岭领馏刘龙聋咙笼垄拢陇楼娄搂篓芦卢颅庐炉掳卤虏鲁赂禄录陆驴吕铝侣屡缕虑滤绿峦挛孪滦乱抡轮伦仑沦纶论萝罗逻锣箩骡骆络妈玛码蚂马骂吗买麦卖迈脉瞒馒蛮满谩猫锚铆贸么霉没镁门闷们锰梦谜弥觅幂绵缅庙灭悯闽鸣铭谬谋亩钠纳难挠脑恼闹馁内拟腻撵捻酿鸟聂啮镊镍柠狞宁拧泞钮纽脓浓农疟诺欧鸥殴呕沤盘庞赔喷鹏骗飘频贫苹凭评泼颇扑铺朴谱栖凄脐齐骑岂启气弃讫牵扦钎铅迁签谦钱钳潜浅谴堑枪呛墙蔷强抢锹桥乔侨翘窍窃钦亲寝轻氢倾顷请庆琼穷趋区躯驱龋颧权劝却鹊确让饶扰绕热韧认纫荣绒软锐闰润洒萨鳃赛伞丧骚扫涩杀纱筛晒删闪陕赡缮伤赏烧绍赊摄慑设绅审婶肾渗声绳胜圣师狮湿诗尸时蚀实识驶势适释饰视试寿兽枢输书赎属术树竖数帅双谁税顺说硕烁丝饲耸怂颂讼诵擞苏诉肃虽随绥岁孙损笋缩琐锁獭挞态摊贪瘫滩坛谭谈叹汤烫涛绦讨腾誊锑题体屉条贴铁厅听烃铜统头秃图涂团颓蜕脱鸵驮驼椭洼袜弯湾顽万网韦违围为潍维苇伟伪纬谓卫温闻纹稳问瓮挝蜗涡窝卧呜钨乌污诬无芜吴坞雾务误锡牺袭习铣戏细虾辖峡侠狭厦吓锨鲜纤咸贤衔闲显险现献县馅羡宪线厢镶乡详响项萧嚣销晓啸蝎协挟携胁谐写泻谢锌衅兴汹锈绣虚嘘须许叙绪续轩悬选癣绚学勋询寻驯训讯逊压鸦鸭哑亚讶阉烟盐严颜阎艳厌砚彦谚验鸯杨扬疡阳痒养样瑶摇尧遥窑谣药爷页业叶医铱颐遗仪蚁艺亿忆义诣议谊译异绎荫阴银饮隐樱婴鹰应缨莹萤营荧蝇赢颖哟拥佣痈踊咏涌优忧邮铀犹游诱舆鱼渔娱与屿语吁御狱誉预驭鸳渊辕园员圆缘远愿约跃钥岳粤悦阅云郧匀陨运蕴酝晕韵杂灾载攒暂赞赃脏凿枣责择则泽贼赠扎札轧铡闸栅诈斋债毡盏斩辗崭栈战绽张涨帐账胀赵蛰辙锗这贞针侦诊镇阵挣睁狰争帧郑证织职执纸挚掷帜质滞钟终种肿众诌轴皱昼骤猪诸诛烛瞩嘱贮铸筑驻专砖转赚桩庄装妆壮状锥赘坠缀谆浊兹资渍踪综总纵邹诅组钻刮台飓哔扬核飕昵唢飒觎晖觊睑觐啬觑饴眬蒙饥饬饪吃饨昙晔咱觞暧飙颔俯袆衔颉颏众颌启升褛亵颃顸眦睐念颞颦困颢颟褴裆颙颜颚呗拐衮疱皲杯骈拐袅制荡里驽驷驸愈蛴蚝馈馊糇胧喂虿饷肴馄余蛎饽冲痫痨蔑疠愈瘾馔癞馑只馐症疖馍飨癫咤雠鲠燕谶揿谳赞髋痹酸髅捣埯撷发谟谪构骛骐苏产讴骍谒骝瓯榨骞谡谑谧驿毁骅骁掼骜蓦骠掴囵骢谲哗骊谯噪谮骥抟骧斓瑷啭嗫玑苏呓啰珰诰玺璇诳诶鲑诮鲔琏志咛谙鲠谌鲩鲨谖尝诨旗噜谛谔鲷谏啮咨谕鲱鲵鲲咽谂鲳鲮谀向珑鲶谄嘤鳀璎诿瓒鲫诤鳊胡证注诃松撄恶须讷欣嗳璃阋哄讪托哝讦鬓哒讧当哙郁喽琅诙诘叹魇诠唛诟诩啧玮鲀唠诏呒讵扬叽诋鱿鸢鸠凫抛迹佩兹珏鳄俪俨罗鲈傥呆鳝犷鳜俦侪鳟猕鲟尽侬鳖狯鳕鳌鲢赟戗鳗鲣鲥赝鳏鳐鳍戆兖狲鳒鲗凶戋鲽鳅偬背鸶鹪家赈鹬鹭赅鹇贲鹫剩鹞鹨鸷效伧鹧赓鹜偾莺牦鹡狸鹚采雇鹟荦挂鹑贻赀偻鸫鹗鹕仆鹙鹉仿卷鹄鹎鹌扪牍舍伥抵幸鹆鹁鹈鸪鸻伪鸨鸩溪鸰鸮鸱鸲熏耀焘乃毁回焖磷黩炖恻烨恽焰么面炝曲曲凄怅辔恒轳茕炀毂匮炜辘暖辉匦汇鸬鹂鸾鹦鹳辂轾恤辄辍轲轼轶蒙怼轸懔忏轭轪轫恹懑照躏勋为龛蹑剿蹰踯踬趸跻劢滟跷恸蹒沣出龈龊龉欲迹戚龌跄灏鳌泷潴惬濑克弥潋蜷恺渎滢怆浏忾渖鼹铲潇泸悫胫周修岚唇径罂坛岽峥嵛崃沓仑昆罴羁湿巯准迩羟脍逦岩膻巅郄卤峣脏崄浒胪岙膑嵘岖台脔邝缛缜绉邺缞缢缙萦溆缥缧纤邬浔缭尴缪缤缱颍系郦聩酦岘颣累澄腌钗钍浚钕钐扣钏焊钊厘酽蒙强别钯绐绀钤钣泛凼纨雕钛纥纡氲纣纭氩钿佛钸纮钰钹钴纰纾铉铊钜泛钺绛吊钽钼绌弦钲钩绦铏绻铳绶彩苋铢铨绾绫绮绺铦铟铐铯铵捆锉缍锈缗锒烟铤铗缈致缇徕亘复绯铓彷锂缂锬帻铮锱檐锟帼铔箫并帏篑箪铼布泄伫表蓑锢锠占铺锜钖锷炼艳钥锴签钔箓针籁锾藤锶浃锲夫泾镕厮锤镉妆曲刍系镒俣铠镃蓥铩廪团镠铿苎籴锵镛模局镙镚铧渌镪糁镖镂镳铄炉荨銮荞笕镬鉴镴桡锏镌奁桦镯镮铛铎梁奂茑枞钟镫榉棂箧橥枥榈栉蔺笃橹筱薮筚侄筝槟姜奸个荟台芗梼樯桧姗柽历殁稣药埚秾敛获垩禀棱埙冢栾莴榄茔棂球墙席荪窦闼辟阚阙阖闿荜闱板阒殚殡殓壸殇阊阆闾莅坜搜合莳圹垆闲闵闳埙殒闩妫婵娆虱升袅嬷嫔猬杆佑秘娘砺址蚬隽籼梾枭禅陧蝼堤祯宁只祎蛳靓虬雳硖霭叆桢朱腼靥茏炮沾桠蕲霁娅藓韪硗韬盘蛱矶杠缰碜千碛椁规娲妪袅娴娴妩秋管丬谷盘挽跶跖干佘熏么勚龅龃龇墉酰巨铚征锽折于慭栗殷愠悭舄桊";
  static String traditionalChinse = "㴱澮琿儺闐竈贄曨緇嶠僉廕鄆碭繒纊蕷闚灕鶡薳鎵鈁鈈銣竪鑭錒鐒鉿詘幇畵釕糼頲滎閼贋軹繯絶羋閲輳瑒閽獮鸘縞蹕謚貺賚輜攄鸌託鮃鈮黶鮒薺藶録醖鋶餼鯀鈎郟陘僞鐦鋨綉鉄犠窰閫懌訁飠糹釒咼禰蟣蟶鯔糲弳鏑孌鋮獫鄶萇鷀歟鍤滻顬韉鋯覡嚦氂覘玀鈰闍諏奬騶嬙鐃詁黽鋙嶧櫟梔蟯衕藎齎饜閾闋誄鴯鶓媯瘺駡觶紱颮梘縵騭褌鱺鯖驌熲鉢廡戱篔澠嶗躒钁魎鷄蠑蟎壠蒓韞槤鮫媼頴戩縕繅鷯鴷鷈鈧錛騧鮎鰾燶檟贔鮞鼉鮋賫鮚綯螿癭饢鱟騤窶籩餳鉍駰麩鍀銠鉕鎇鋦詵緑鵐藴駔倈獁輈糶鋭鏇鱂鱠齏赬鮓籜鰺鐨鍩錇黌齶鱝鳾幬賙紼瘞縭櫞譫縧薴魴壋埡禡啢慤櫧覯頽轀鑌鎿鏷頎驌淶濼埰鸏鯗噦賾鸂諑輞鰒憮礱貰瘂縋鏜釓銪灠黿鐿繸錁鏨崬誆蔞鉺鋱鈳鎦碸鐠鈥銩鍠轢鐓鎪蘺鈃髕塒厠硨殻綆覥穡鍈賕熅毿撝齕嶔絝鰼櫝鬮緄駘顙劌蕕鰐誾薀諝騸嘵絰鐔鷽硜嬡鹺鏝鮜櫬緗鮞譅艫蕓紵鏇櫳饊屨噚薘謡艤聹馹屓驂塏緦簀蓴鑕嶁鰨鷁鉋讜蓯蟈攛鮚鶼蕆溈鰳飫俔餖飣鰟鮍癉瘲灄轔訒鎸闤闠酇憒鱭戱餺飥瑲鰉剴軺櫨欏誶綃鈄鮊榿蘞榲衚鲅鶥瘻厙綈窵賧紲嗊癧賰賻閆驦鰷紝梲駸儐繢縶腽閿閈詗鷳齗藭襏詖鱣剄齠鰃鯒鋟潿鰮覿掗鱣耬鱤瑲綳葒閌蕢躦鱧悞鰏唚驫耮鮶龎賵餜颻簹鶬鶊鯝釃煱鵷澦繮撏闒鷫鵂瞶潷撟厴澩掗擓趲鈒臢鴰鷊虆魢鱨鮳鱨鱯鯕鋝傴湞倈闠嫿魛鮦腖嘽軲籪窵勩詿繰賵輬贐鏌鳬鸇悞詗嚲鰁鷖鵁擼鳲鵃棖鱅鋥潙櫱霢鎄餕氌緔鞝釔鈹産爲詒釙騅鑥衆滙纈専涙綫ト蕘脇暘囯喦処蔴凃飈崐篛啓頊顔葠鶹尅牀鵾関厤銚隣鮐錆説艢勗蘀鎛磑廼廻瀠鍾韃裏糸彙皚藹礙愛襖奧壩罷擺敗頒辦絆幫綁鎊謗剝飽寶報鮑輩貝鋇狽備憊繃筆畢斃幣閉邊編貶變辯辮標鱉別癟瀕濱賓擯餅並撥缽鉑駁蔔補財參蠶殘慚慘燦蒼艙倉滄廁側冊測層詫攙摻蟬饞讒纏鏟產闡顫場嘗長償腸廠暢鈔車徹塵陳襯撐稱懲誠騁癡遲馳恥齒熾沖蟲寵疇躊籌綢醜櫥廚鋤雛礎儲觸處傳瘡闖創錘純綽辭詞賜聰蔥囪從叢湊躥竄錯達帶貸擔單鄲撣膽憚誕彈當擋黨蕩檔搗島禱導盜燈鄧敵滌遞締顛點墊電澱釣調諜疊釘頂錠訂丟東動棟凍鬥犢獨讀賭鍍鍛斷緞兌隊對噸頓鈍奪墮鵝額訛惡餓兒爾餌貳發罰閥琺礬釩煩範販飯訪紡飛誹廢費紛墳奮憤糞豐楓鋒風瘋馮縫諷鳳膚輻撫輔賦複負訃婦縛該鈣蓋幹趕稈贛岡剛鋼綱崗鎬擱鴿閣鉻個給龔宮鞏貢鉤溝構購夠蠱顧剮關觀館慣貫廣規矽歸龜閨軌詭櫃貴劊輥滾鍋國過駭韓漢號閡鶴賀橫轟鴻紅後壺護滬戶嘩華畫劃話懷壞歡環還緩換喚瘓煥渙黃謊揮輝毀賄穢會燴匯諱誨繪葷渾夥獲貨禍擊機積饑譏雞績緝極輯級擠幾薊劑濟計記際繼紀夾莢頰賈鉀價駕殲監堅箋間艱緘繭檢堿鹼揀撿簡儉減薦檻鑒踐賤見鍵艦劍餞漸濺澗將漿蔣槳獎講醬膠澆驕嬌攪鉸矯僥腳餃繳絞轎較階節莖鯨驚經頸靜鏡徑痙競淨糾廄舊駒舉據鋸懼劇鵑絹傑潔結誡屆緊錦僅謹進晉燼盡勁荊覺決訣絕鈞軍駿開凱顆殼課墾懇摳庫褲誇塊儈寬礦曠況虧巋窺饋潰擴闊蠟臘萊來賴藍欄攔籃闌蘭瀾讕攬覽懶纜爛濫撈勞澇樂鐳壘類淚籬離裡鯉禮麗厲勵礫曆瀝隸倆聯蓮連鐮憐漣簾斂臉鏈戀煉練糧涼兩輛諒療遼鐐獵臨鄰鱗凜賃齡鈴淩靈嶺領餾劉龍聾嚨籠壟攏隴樓婁摟簍蘆盧顱廬爐擄鹵虜魯賂祿錄陸驢呂鋁侶屢縷慮濾綠巒攣孿灤亂掄輪倫侖淪綸論蘿羅邏鑼籮騾駱絡媽瑪碼螞馬罵嗎買麥賣邁脈瞞饅蠻滿謾貓錨鉚貿麼黴沒鎂門悶們錳夢謎彌覓冪綿緬廟滅憫閩鳴銘謬謀畝鈉納難撓腦惱鬧餒內擬膩攆撚釀鳥聶齧鑷鎳檸獰甯擰濘鈕紐膿濃農瘧諾歐鷗毆嘔漚盤龐賠噴鵬騙飄頻貧蘋憑評潑頗撲鋪樸譜棲淒臍齊騎豈啟氣棄訖牽扡釺鉛遷簽謙錢鉗潛淺譴塹槍嗆牆薔強搶鍬橋喬僑翹竅竊欽親寢輕氫傾頃請慶瓊窮趨區軀驅齲顴權勸卻鵲確讓饒擾繞熱韌認紉榮絨軟銳閏潤灑薩鰓賽傘喪騷掃澀殺紗篩曬刪閃陝贍繕傷賞燒紹賒攝懾設紳審嬸腎滲聲繩勝聖師獅濕詩屍時蝕實識駛勢適釋飾視試壽獸樞輸書贖屬術樹豎數帥雙誰稅順說碩爍絲飼聳慫頌訟誦擻蘇訴肅雖隨綏歲孫損筍縮瑣鎖獺撻態攤貪癱灘壇譚談歎湯燙濤絛討騰謄銻題體屜條貼鐵廳聽烴銅統頭禿圖塗團頹蛻脫鴕馱駝橢窪襪彎灣頑萬網韋違圍為濰維葦偉偽緯謂衛溫聞紋穩問甕撾蝸渦窩臥嗚鎢烏汙誣無蕪吳塢霧務誤錫犧襲習銑戲細蝦轄峽俠狹廈嚇鍁鮮纖鹹賢銜閑顯險現獻縣餡羨憲線廂鑲鄉詳響項蕭囂銷曉嘯蠍協挾攜脅諧寫瀉謝鋅釁興洶鏽繡虛噓須許敘緒續軒懸選癬絢學勳詢尋馴訓訊遜壓鴉鴨啞亞訝閹煙鹽嚴顏閻豔厭硯彥諺驗鴦楊揚瘍陽癢養樣瑤搖堯遙窯謠藥爺頁業葉醫銥頤遺儀蟻藝億憶義詣議誼譯異繹蔭陰銀飲隱櫻嬰鷹應纓瑩螢營熒蠅贏穎喲擁傭癰踴詠湧優憂郵鈾猶遊誘輿魚漁娛與嶼語籲禦獄譽預馭鴛淵轅園員圓緣遠願約躍鑰嶽粵悅閱雲鄖勻隕運蘊醞暈韻雜災載攢暫贊贓髒鑿棗責擇則澤賊贈紮劄軋鍘閘柵詐齋債氈盞斬輾嶄棧戰綻張漲帳賬脹趙蟄轍鍺這貞針偵診鎮陣掙睜猙爭幀鄭證織職執紙摯擲幟質滯鐘終種腫眾謅軸皺晝驟豬諸誅燭矚囑貯鑄築駐專磚轉賺樁莊裝妝壯狀錐贅墜綴諄濁茲資漬蹤綜總縱鄒詛組鑽颳颱颶嗶颺覈颼暱嗩颯覦暉覬瞼覲嗇覷飴矓矇飢飭飪喫飩曇曄喒觴曖飆頷頫褘啣頡頦眾頜啟昇褸褻頏頇眥睞唸顳顰睏顥顢襤襠顒顏顎唄枴袞皰皸盃駢柺裊製盪裡駑駟駙瘉蠐蠔餽餿餱朧餵蠆餉餚餛餘蠣餑衝癇癆衊癘癒癮饌癩饉衹饈癥癤饃饗癲吒讎骾讌讖撳讞讚髖痺痠髏擣垵擷髮謨謫搆騖騏甦產謳騂謁騮甌搾騫謖謔謐驛譭驊驍摜驁驀驃摑圇驄譎譁驪譙譟譖驥摶驤斕璦囀囁璣囌囈囉璫誥璽璿誑誒鮭誚鮪璉誌嚀諳鯁諶鯇鯊諼嚐諢旂嚕諦諤鯛諫嚙諮諭鯡鯢鯤嚥諗鯧鯪諛嚮瓏鯰諂嚶鯷瓔諉瓚鯽諍鯿鬍証註訶鬆攖噁鬚訥訢噯琍鬩鬨訕託噥訐鬢噠訌噹噲鬱嘍瑯詼詰嘆魘詮嘜詬詡嘖瑋魨嘮詔嘸詎敭嘰詆魷鳶鳩鳧拋跡珮玆玨鱷儷儼儸鱸儻獃鱔獷鱖儔儕鱒獼鱘儘儂鱉獪鱈鰲鰱贇戧鰻鰹鰣贗鰥鰩鰭戇兗猻鰜鰂兇戔鰈鰍傯揹鷥鷦傢賑鷸鷺賅鷴賁鷲賸鷂鷚鷙傚傖鷓賡鶩僨鶯犛鶺貍鶿採僱鶲犖掛鶉貽貲僂鶇鶚鶘僕鶖鵡倣捲鵠鵯鵪捫牘捨倀牴倖鵒鵓鵜鴣鴴偽鴇鴆谿鴒鴞鴟鴝燻燿燾迺燬迴燜燐黷燉惻燁惲燄麼麵熗麴麯悽悵轡恆轤煢煬轂匱煒轆煖煇匭匯鸕鸝鸞鸚鸛輅輊卹輒輟軻軾軼懞懟軫懍懺軛軑軔懨懣炤躪勛為龕躡勦躕躑躓躉躋勱灩蹺慟蹣灃齣齦齪齬慾蹟慼齷蹌灝鼇瀧瀦愜瀨剋瀰瀲踡愷瀆瀅愴瀏愾瀋鼴剷瀟瀘愨脛週脩嵐脣逕罌罈崠崢崳崍遝崙崑羆羈溼巰準邇羥膾邐巖羶巔郤滷嶢臟嶮滸臚嶴臏嶸嶇臺臠鄺縟縝縐鄴縗縊縉縈漵縹縲縴鄔潯繚尷繆繽繾潁繫酈聵醱峴纇纍澂醃釵釷濬釹釤釦釧釬釗釐釅濛彊彆鈀紿紺鈐鈑氾氹紈彫鈦紇紆氳紂紜氬鈿彿鈽紘鈺鈸鈷紕紓鉉鉈鉅汎鉞絳弔鉭鉬絀絃鉦鉤絛鉶綣銃綬綵莧銖銓綰綾綺綹銛銦銬銫銨綑銼綞銹緡鋃菸鋌鋏緲緻緹徠亙復緋鋩徬鋰緙錟幘錚錙簷錕幗錏簫併幃簣簞錸佈洩佇錶簑錮錩佔舖錡鍚鍔鍊艷籥鍇籤鍆籙鍼籟鍰籐鍶浹鍥伕涇鎔廝鎚鎘粧粬芻係鎰俁鎧鎡鎣鎩廩糰鏐鏗苧糴鏘鏞糢侷鏍鏰鏵淥鏹糝鏢鏤鑣鑠鑪蕁鑾蕎筧鑊鑑鑞橈鐧鐫奩樺鐲鐶鐺鐸樑奐蔦樅鐘鐙櫸櫺篋櫫櫪櫚櫛藺篤櫓篠藪篳姪箏檳薑姦箇薈檯薌檮檣檜姍檉歷歿穌葯堝穠歛穫堊稟稜塤塚欒萵欖塋欞毬墻蓆蓀竇闥闢闞闕闔闓蓽闈闆闃殫殯殮壼殤閶閬閭蒞壢蒐閤蒔壙壚閒閔閎壎殞閂嬀嬋嬈蝨陞嬝嬤嬪蝟桿祐祕孃礪阯蜆雋秈棶梟禪隉螻隄禎寧隻禕螄靚虯靂硤靄靉楨硃靦靨蘢砲霑椏蘄霽婭蘚韙磽韜槃蛺磯槓韁磣韆磧槨槼媧嫗嫋嫻嫺嫵鞦琯爿穀磐輓躂蹠乾畲薰麽勩齙齟齜鄘醯鉅銍徵鍠摺於憖慄慇慍慳潟棬";

  public static String normalize(String str, boolean isUpperCase)
  {
    char c = '\000';
    if (str == null) {
      return str;
    }
    StringBuilder buf = new StringBuilder(str.length());
    char[] sent = str.toCharArray();
    for (int i = 0; i < str.length(); i++) {
      if ((sent[i] >= 65281) && (sent[i] <= 65374)) {
        c = (char)(sent[i] - 65248);
      } else if (sent[i] == '　') {
        c = ' ';
      } else {
        c = sent[i];
      }
      int index = traditionalChinse.indexOf(c);
      if (index != -1) {
        c = simpleChinese.charAt(index);
      }

      if (isUpperCase) {
        buf.append(getNormailzedPunctionUpperCase(c));
      } else {
        buf.append(getNormailzedPunctionLowerCase(c));
      }
    }

    return buf.toString();
  }

  public static String normalize(String str)
  {
    char c = '\000';
    if (str == null) {
      return str;
    }
    StringBuilder buf = new StringBuilder(str.length());
    char[] sent = str.toCharArray();
    for (int i = 0; i < str.length(); i++) {
      if ((sent[i] >= 65281) && (sent[i] <= 65374)) {
        c = (char)(sent[i] - 65248);
      } else if (sent[i] == '　') {
        c = ' ';
      } else {
        c = sent[i];
      }
      int index = traditionalChinse.indexOf(c);
      if (index != -1) {
        c = simpleChinese.charAt(index);
      }
      buf.append(getNormailzedPunction(c));
    }
    return buf.toString();
  }

  public static char getNormailzedPunction(char ch) {
    if ((ch == 65292) || (ch == ',') || (ch == 65104))
      return 65292;
    if ((ch == 65106) || (ch == '.') || (ch == 65294))
      return '.';
    if ((ch == '、') || (ch == 65105))
      return '、';
    if ((ch == '‘') || (ch == '`'))
      return '‘';
    if ((ch == '’') || (ch == '´'))
      return '’';
    if ((ch == '“') || (ch == '〝'))
      return '“';
    if ((ch == '”') || (ch == '〞'))
      return '”';
    if ((ch == '!') || (ch == 65111) || (ch == 65281))
      return 65281;
    if ((ch == 65311) || (ch == '?') || (ch == 65110))
      return 65311;
    if ((ch == 65306) || (ch == ':') || (ch == 65072) || (ch == 65109) || (ch == '∶'))
      return 65306;
    if ((ch == 65307) || (ch == ';') || (ch == 65108))
      return 65307;
    if ((ch == '-') || (ch == 65293) || (ch == '─') || (ch == 65123) || (ch == '–') ||
      (ch == '―') || (ch == '━'))
      return '-';
    if ((ch == 65288) || (ch == '(') || (ch == 65113) || (ch == '〔'))
      return 65288;
    if ((ch == 65289) || (ch == ')') || (ch == 65114) || (ch == '〕'))
      return 65289;
    if ((ch == '{') || (ch == 65371))
      return '{';
    if ((ch == '}') || (ch == 65373))
      return '}';
    if ((ch == '<') || (ch == '〈') || (ch == 65124) || (ch == 65308))
      return '<';
    if ((ch == '>') || (ch == '〉') || (ch == 65125) || (ch == 65310))
      return '>';
    if ((ch == '|') || (ch == 65372) || (ch == '│'))
      return '|';
    if ((ch == '/') || (ch == 65295) || (ch == '∕'))
      return '/';
    if ((ch == '@') || (ch == 65312))
      return '@';
    if ((ch == '&') || (ch == 65286))
      return '&';
    if ((ch == '#') || (ch == 65283))
      return '#';
    if ((ch == '%') || (ch == 65130) || (ch == 65285))
      return '%';
    if ((ch == '¥') || (ch == 65509))
      return '¥';
    if ((ch == '+') || (ch == 65291))
      return '+';
    if ((ch == '=') || (ch == 65309))
      return '=';
    if ((ch == '×') || (ch == '╳'))
      return '×';
    if ((ch == '≥') || (ch == '≧'))
      return '≥';
    if ((ch == '≤') || (ch == '≦'))
      return '≤';
    if ((ch == 'Σ') || (ch == '∑'))
      return 'Σ';
    if ((ch == '【') || (ch == '〖'))
      return '【';
    if ((ch == '】') || (ch == '〗'))
      return '】';
    if ((ch == '「') || (ch == '『') || (ch == 65089) || (ch == 65091))
      return '「';
    if ((ch == '」') || (ch == '』') || (ch == 65090) || (ch == 65092)) {
      return '」';
    }
    if ((ch == '•') || (ch == '●') || (ch == '〇') || (ch == '■') || (ch == '◆') ||
      (ch == '◇') || (ch == '▲') || (ch == '△') || (ch == '★') ||
      (ch == '☆') || (ch == '®') || (ch == '卍') || (ch == '※')) {
      return '•';
    }
    return ch;
  }

  public static char getNormailzedPunctionLowerCase(char ch) {
    if ((ch == 'A') || (ch == 65313) || (ch == 'a') || (ch == 65345))
      return 'a';
    if ((ch == 'B') || (ch == 65314) || (ch == 'b') || (ch == 65346))
      return 'b';
    if ((ch == 'C') || (ch == 65315) || (ch == 'c') || (ch == 65347))
      return 'c';
    if ((ch == 'D') || (ch == 65316) || (ch == 'd') || (ch == 65348))
      return 'd';
    if ((ch == 'E') || (ch == 65317) || (ch == 'e') || (ch == 65349))
      return 'e';
    if ((ch == 'F') || (ch == 65318) || (ch == 'f') || (ch == 65350))
      return 'f';
    if ((ch == 'G') || (ch == 65319) || (ch == 'g') || (ch == 65351))
      return 'g';
    if ((ch == 'H') || (ch == 65320) || (ch == 'h') || (ch == 65352))
      return 'h';
    if ((ch == 'I') || (ch == 65321) || (ch == 'i') || (ch == 65353))
      return 'i';
    if ((ch == 'J') || (ch == 65322) || (ch == 'j') || (ch == 65354))
      return 'j';
    if ((ch == 'K') || (ch == 65323) || (ch == 'k') || (ch == 65355))
      return 'k';
    if ((ch == 'L') || (ch == 65324) || (ch == 'l') || (ch == 65356))
      return 'l';
    if ((ch == 'M') || (ch == 65325) || (ch == 'm') || (ch == 65357))
      return 'm';
    if ((ch == 'N') || (ch == 65326) || (ch == 'n') || (ch == 65358))
      return 'n';
    if ((ch == 'O') || (ch == 65327) || (ch == 'o') || (ch == 65359))
      return 'o';
    if ((ch == 'P') || (ch == 65328) || (ch == 'p') || (ch == 65360))
      return 'p';
    if ((ch == 'Q') || (ch == 65329) || (ch == 'q') || (ch == 65361))
      return 'q';
    if ((ch == 'R') || (ch == 65330) || (ch == 'r') || (ch == 65362))
      return 'r';
    if ((ch == 'S') || (ch == 65331) || (ch == 's') || (ch == 65363))
      return 's';
    if ((ch == 'T') || (ch == 65332) || (ch == 't') || (ch == 65364))
      return 't';
    if ((ch == 'U') || (ch == 65333) || (ch == 'u') || (ch == 65365))
      return 'u';
    if ((ch == 'V') || (ch == 65334) || (ch == 'v') || (ch == 65366))
      return 'v';
    if ((ch == 'W') || (ch == 65335) || (ch == 'w') || (ch == 65367))
      return 'w';
    if ((ch == 'X') || (ch == 65336) || (ch == 'x') || (ch == 65368))
      return 'x';
    if ((ch == 'Y') || (ch == 65337) || (ch == 'y') || (ch == 65369))
      return 'y';
    if ((ch == 'Z') || (ch == 65338) || (ch == 'z') || (ch == 65370)) {
      return 'z';
    }
    if ((ch == '0') || (ch == 65296))
      return '0';
    if ((ch == '1') || (ch == 65297))
      return '1';
    if ((ch == '2') || (ch == 65298))
      return '2';
    if ((ch == '3') || (ch == 65299))
      return '3';
    if ((ch == '4') || (ch == 65300))
      return '4';
    if ((ch == '5') || (ch == 65301))
      return '5';
    if ((ch == '6') || (ch == 65302))
      return '6';
    if ((ch == '7') || (ch == 65303))
      return '7';
    if ((ch == '8') || (ch == 65304))
      return '8';
    if ((ch == '9') || (ch == 65305)) {
      return '9';
    }
    if ((ch == 65292) || (ch == ',') || (ch == 65104))
      return 65292;
    if ((ch == 65106) || (ch == '.') || (ch == 65294))
      return '.';
    if ((ch == '、') || (ch == 65105))
      return '、';
    if ((ch == '‘') || (ch == '`'))
      return '‘';
    if ((ch == '’') || (ch == '´'))
      return '’';
    if ((ch == '“') || (ch == '〝'))
      return '“';
    if ((ch == '”') || (ch == '〞'))
      return '”';
    if ((ch == '!') || (ch == 65111) || (ch == 65281))
      return 65281;
    if ((ch == 65311) || (ch == '?') || (ch == 65110))
      return 65311;
    if ((ch == 65306) || (ch == ':') || (ch == 65072) || (ch == 65109) || (ch == '∶'))
      return 65306;
    if ((ch == 65307) || (ch == ';') || (ch == 65108))
      return 65307;
    if ((ch == '-') || (ch == 65293) || (ch == '─') || (ch == 65123) || (ch == '–') ||
      (ch == '―') || (ch == '━'))
      return '-';
    if ((ch == 65288) || (ch == '(') || (ch == 65113) || (ch == '〔'))
      return 65288;
    if ((ch == 65289) || (ch == ')') || (ch == 65114) || (ch == '〕'))
      return 65289;
    if ((ch == '{') || (ch == 65371))
      return '{';
    if ((ch == '}') || (ch == 65373))
      return '}';
    if ((ch == '<') || (ch == '〈') || (ch == 65124) || (ch == 65308))
      return '<';
    if ((ch == '>') || (ch == '〉') || (ch == 65125) || (ch == 65310))
      return '>';
    if ((ch == '|') || (ch == 65372) || (ch == '│'))
      return '|';
    if ((ch == '/') || (ch == 65295) || (ch == '∕'))
      return '/';
    if ((ch == '@') || (ch == 65312))
      return '@';
    if ((ch == '&') || (ch == 65286))
      return '&';
    if ((ch == '#') || (ch == 65283))
      return '#';
    if ((ch == '%') || (ch == 65130) || (ch == 65285))
      return '%';
    if ((ch == '¥') || (ch == 65509))
      return '¥';
    if ((ch == '+') || (ch == 65291))
      return '+';
    if ((ch == '=') || (ch == 65309))
      return '=';
    if ((ch == '×') || (ch == '╳'))
      return '×';
    if ((ch == '≥') || (ch == '≧'))
      return '≥';
    if ((ch == '≤') || (ch == '≦'))
      return '≤';
    if ((ch == 'Σ') || (ch == '∑'))
      return 'Σ';
    if ((ch == '【') || (ch == '〖'))
      return '【';
    if ((ch == '】') || (ch == '〗'))
      return '】';
    if ((ch == '「') || (ch == '『') || (ch == 65089) || (ch == 65091))
      return '「';
    if ((ch == '」') || (ch == '』') || (ch == 65090) || (ch == 65092)) {
      return '」';
    }
    if ((ch == '•') || (ch == '●') || (ch == '〇') || (ch == '■') || (ch == '◆') ||
      (ch == '◇') || (ch == '▲') || (ch == '△') || (ch == '★') ||
      (ch == '☆') || (ch == '®') || (ch == '卍') || (ch == '※')) {
      return '•';
    }
    return ch;
  }

  public static char getNormailzedPunctionUpperCase(char ch) {
    if ((ch == 'A') || (ch == 65313) || (ch == 'a') || (ch == 65345))
      return 'A';
    if ((ch == 'B') || (ch == 65314) || (ch == 'b') || (ch == 65346))
      return 'B';
    if ((ch == 'C') || (ch == 65315) || (ch == 'c') || (ch == 65347))
      return 'C';
    if ((ch == 'D') || (ch == 65316) || (ch == 'd') || (ch == 65348))
      return 'D';
    if ((ch == 'E') || (ch == 65317) || (ch == 'e') || (ch == 65349))
      return 'E';
    if ((ch == 'F') || (ch == 65318) || (ch == 'f') || (ch == 65350))
      return 'F';
    if ((ch == 'G') || (ch == 65319) || (ch == 'g') || (ch == 65351))
      return 'G';
    if ((ch == 'H') || (ch == 65320) || (ch == 'h') || (ch == 65352))
      return 'H';
    if ((ch == 'I') || (ch == 65321) || (ch == 'i') || (ch == 65353))
      return 'I';
    if ((ch == 'J') || (ch == 65322) || (ch == 'j') || (ch == 65354))
      return 'J';
    if ((ch == 'K') || (ch == 65323) || (ch == 'k') || (ch == 65355))
      return 'K';
    if ((ch == 'L') || (ch == 65324) || (ch == 'l') || (ch == 65356))
      return 'L';
    if ((ch == 'M') || (ch == 65325) || (ch == 'm') || (ch == 65357))
      return 'M';
    if ((ch == 'N') || (ch == 65326) || (ch == 'n') || (ch == 65358))
      return 'N';
    if ((ch == 'O') || (ch == 65327) || (ch == 'o') || (ch == 65359))
      return 'O';
    if ((ch == 'P') || (ch == 65328) || (ch == 'p') || (ch == 65360))
      return 'P';
    if ((ch == 'Q') || (ch == 65329) || (ch == 'q') || (ch == 65361))
      return 'Q';
    if ((ch == 'R') || (ch == 65330) || (ch == 'r') || (ch == 65362))
      return 'R';
    if ((ch == 'S') || (ch == 65331) || (ch == 's') || (ch == 65363))
      return 'S';
    if ((ch == 'T') || (ch == 65332) || (ch == 't') || (ch == 65364))
      return 'T';
    if ((ch == 'U') || (ch == 65333) || (ch == 'u') || (ch == 65365))
      return 'U';
    if ((ch == 'V') || (ch == 65334) || (ch == 'v') || (ch == 65366))
      return 'V';
    if ((ch == 'W') || (ch == 65335) || (ch == 'w') || (ch == 65367))
      return 'W';
    if ((ch == 'X') || (ch == 65336) || (ch == 'x') || (ch == 65368))
      return 'X';
    if ((ch == 'Y') || (ch == 65337) || (ch == 'y') || (ch == 65369))
      return 'Y';
    if ((ch == 'Z') || (ch == 65338) || (ch == 'z') || (ch == 65370)) {
      return 'Z';
    }
    if ((ch == '0') || (ch == 65296))
      return '0';
    if ((ch == '1') || (ch == 65297))
      return '1';
    if ((ch == '2') || (ch == 65298))
      return '2';
    if ((ch == '3') || (ch == 65299))
      return '3';
    if ((ch == '4') || (ch == 65300))
      return '4';
    if ((ch == '5') || (ch == 65301))
      return '5';
    if ((ch == '6') || (ch == 65302))
      return '6';
    if ((ch == '7') || (ch == 65303))
      return '7';
    if ((ch == '8') || (ch == 65304))
      return '8';
    if ((ch == '9') || (ch == 65305)) {
      return '9';
    }
    if ((ch == 65292) || (ch == ',') || (ch == 65104))
      return 65292;
    if ((ch == 65106) || (ch == '.') || (ch == 65294))
      return '.';
    if ((ch == '、') || (ch == 65105))
      return '、';
    if ((ch == '‘') || (ch == '`'))
      return '‘';
    if ((ch == '’') || (ch == '´'))
      return '’';
    if ((ch == '“') || (ch == '〝'))
      return '“';
    if ((ch == '”') || (ch == '〞'))
      return '”';
    if ((ch == '!') || (ch == 65111) || (ch == 65281))
      return 65281;
    if ((ch == 65311) || (ch == '?') || (ch == 65110))
      return 65311;
    if ((ch == 65306) || (ch == ':') || (ch == 65072) || (ch == 65109) || (ch == '∶'))
      return 65306;
    if ((ch == 65307) || (ch == ';') || (ch == 65108))
      return 65307;
    if ((ch == '-') || (ch == 65293) || (ch == '─') || (ch == 65123) || (ch == '–') ||
      (ch == '―') || (ch == '━'))
      return '-';
    if ((ch == 65288) || (ch == '(') || (ch == 65113) || (ch == '〔'))
      return 65288;
    if ((ch == 65289) || (ch == ')') || (ch == 65114) || (ch == '〕'))
      return 65289;
    if ((ch == '{') || (ch == 65371))
      return '{';
    if ((ch == '}') || (ch == 65373))
      return '}';
    if ((ch == '<') || (ch == '〈') || (ch == 65124) || (ch == 65308))
      return '<';
    if ((ch == '>') || (ch == '〉') || (ch == 65125) || (ch == 65310))
      return '>';
    if ((ch == '|') || (ch == 65372) || (ch == '│'))
      return '|';
    if ((ch == '/') || (ch == 65295) || (ch == '∕'))
      return '/';
    if ((ch == '@') || (ch == 65312))
      return '@';
    if ((ch == '&') || (ch == 65286))
      return '&';
    if ((ch == '#') || (ch == 65283))
      return '#';
    if ((ch == '%') || (ch == 65130) || (ch == 65285))
      return '%';
    if ((ch == '¥') || (ch == 65509))
      return '¥';
    if ((ch == '+') || (ch == 65291))
      return '+';
    if ((ch == '=') || (ch == 65309))
      return '=';
    if ((ch == '×') || (ch == '╳'))
      return '×';
    if ((ch == '≥') || (ch == '≧'))
      return '≥';
    if ((ch == '≤') || (ch == '≦'))
      return '≤';
    if ((ch == 'Σ') || (ch == '∑'))
      return 'Σ';
    if ((ch == '【') || (ch == '〖'))
      return '【';
    if ((ch == '】') || (ch == '〗'))
      return '】';
    if ((ch == '「') || (ch == '『') || (ch == 65089) || (ch == 65091))
      return '「';
    if ((ch == '」') || (ch == '』') || (ch == 65090) || (ch == 65092)) {
      return '」';
    }
    if ((ch == '•') || (ch == '●') || (ch == '〇') || (ch == '■') || (ch == '◆') ||
      (ch == '◇') || (ch == '▲') || (ch == '△') || (ch == '★') ||
      (ch == '☆') || (ch == '®') || (ch == '卍') || (ch == '※')) {
      return '•';
    }
    return ch;
  }
}

